#+begin_src python :results output
import pandas as pd

print(pd.show_versions (as_json=True))
#+end_src


#+begin_src python :results output
import numpy as np
import pandas as pd
import string

abc = string.ascii_letters
liste = dict(zip(list(abc[0:26]), np.arange(len(abc))))
#print(dir(string))|
print(liste)
#+end_src

#+begin_src python :results output
import numpy as np
import pandas as pd
import string
v1 = pd.Series(list(string.ascii_letters[0:26]))
v2 = pd.Series(np.arange(len(v1)))

df = pd.concat([v1, v2], axis=1)
#df.index += df.index
print(type(df))
print(df)



#+end_src

#+RESULTS:
#+begin_example
<class 'pandas.core.frame.DataFrame'>
    0   1
0   a   0
1   b   1
2   c   2
3   d   3
4   e   4
5   f   5
6   g   6
7   h   7
8   i   8
9   j   9
10  k  10
11  l  11
12  m  12
13  n  13
14  o  14
15  p  15
16  q  16
17  r  17
18  s  18
19  t  19
20  u  20
21  v  21
22  w  22
23  x  23
24  y  24
25  z  25
#+end_example
